mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/s6e2dhxj.svd
        <!-- REGISTER "LIN_TDR" -->
        <register>
          <name>LIN_TDR</name>
          <description>Transmit Data Register [HW]</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x00FF</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>Data</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_BGR" -->
        <register>
          <name>LIN_BGR</name>
          <description>Baud Rate Generator Registers [BHW]</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXT" -->
            <field>
              <name>EXT</name>
              <description>External clock select bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BGR" -->
            <field>
              <name>BGR</name>
              <description>Baud Rate Generator Register</description>
              <msb>14</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_FCR" -->
        <register>
          <name>LIN_FCR</name>
          <description>FIFO Control Register [BHW]</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0400</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLSTE" -->
            <field>
              <name>FLSTE</name>
              <description>Re-transmission data lost detect enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRIIE" -->
            <field>
              <name>FRIIE</name>
              <description>Received FIFO idle detection enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDRQ" -->
            <field>
              <name>FDRQ</name>
              <description>Transmit FIFO data request bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTIE" -->
            <field>
              <name>FTIE</name>
              <description>Transmit FIFO interrupt enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSEL" -->
            <field>
              <name>FSEL</name>
              <description>FIFO select bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description>FIFO re-transmit data lost flag bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLD" -->
            <field>
              <name>FLD</name>
              <description>FIFO pointer reload bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSET" -->
            <field>
              <name>FSET</name>
              <description>FIFO pointer save bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description>FIFO2 reset bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description>FIFO1 reset bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description>FIFO2 operation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description>FIFO1 operation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_FBYTE1" -->
        <register>
          <name>LIN_FBYTE1</name>
          <description>FIFO Byte Register 1 [BHW]</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FD" -->
            <field>
              <name>FD</name>
              <description>data count in FIFO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_FBYTE2" -->
        <register>
          <name>LIN_FBYTE2</name>
          <description>FIFO Byte Register 2 [BHW]</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FD" -->
            <field>
              <name>FD</name>
              <description>data count in FIFO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
