mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/s6e2dhxj.svd
        <!-- REGISTER "SRST" -->
        <register>
          <name>SRST</name>
          <description>Soft Reset Register [BHW]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRST" -->
            <field>
              <name>SRST</name>
              <description>Soft reset bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INTCNT" -->
        <register>
          <name>INTCNT</name>
          <description>Interrupt Control Register [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F3F0000</resetValue>
          <resetMask>0x7F3F0F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXUD1M" -->
            <field>
              <name>TXUD1M</name>
              <description>This bit masks the transmit FIFO underflow interrupt</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBERM" -->
            <field>
              <name>TBERM</name>
              <description>This bit masks the transmit channel block size error interrupt</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FERRM" -->
            <field>
              <name>FERRM</name>
              <description>This bit masks the frame error interrupt mask</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXUD0M" -->
            <field>
              <name>TXUD0M</name>
              <description>This bit masks the transmit FIFO underflow interrupt</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXOVM" -->
            <field>
              <name>TXOVM</name>
              <description>This bit masks the transmit FIFO overflow interrupt</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXFDM" -->
            <field>
              <name>TXFDM</name>
              <description>This bit masks the transmit DMA request</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXFIM" -->
            <field>
              <name>TXFIM</name>
              <description>This bit masks the transmit FIFO interrupt</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBERM" -->
            <field>
              <name>RBERM</name>
              <description>This bit masks the receive channel block size error interrupt</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXUDM" -->
            <field>
              <name>RXUDM</name>
              <description>This bit masks the receive FIFO underflow interrupt</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXOVM" -->
            <field>
              <name>RXOVM</name>
              <description>This bit masks the receive FIFO overflow interrupt</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOPM" -->
            <field>
              <name>EOPM</name>
              <description>This bit masks the interrupts by EOPI of the STATUS register</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXFDM" -->
            <field>
              <name>RXFDM</name>
              <description>This bit masks the receive DMA request</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXFIM" -->
            <field>
              <name>RXFIM</name>
              <description>This bit masks the receive FIFO interrupt</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFTH" -->
            <field>
              <name>TFTH</name>
              <description>This bit sets the transmit FIFO threshold value</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPTMR" -->
            <field>
              <name>RPTMR</name>
              <description>This is the bit for setting the packet receive completion timer</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFTH" -->
            <field>
              <name>RFTH</name>
              <description>This bit sets the receive FIFO threshold value</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STATUS" -->
        <register>
          <name>STATUS</name>
          <description>Status Register [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF0FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TBERR" -->
            <field>
              <name>TBERR</name>
              <description>This bit is set to 1 if the block size of the DMA transmit channel is set to a value larger than the transmit FIFO threshold value</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RBERR" -->
            <field>
              <name>RBERR</name>
              <description>This bit is set to 1 if the block size of the DMA receive channel is set to a value larger than the receive FIFO threshold value</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FERR" -->
            <field>
              <name>FERR</name>
              <description>This indicates that a frame error has occurred</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXUDR1" -->
            <field>
              <name>TXUDR1</name>
              <description>This is set to 1 when the transmit FIFO underflows at the frame start</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXUDR0" -->
            <field>
              <name>TXUDR0</name>
              <description>This is set to 1 when the transmit FIFO underflows during frame transmission</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXOVR" -->
            <field>
              <name>TXOVR</name>
              <description>This is set to 1 when the transmit FIFO overflows</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXUDR" -->
            <field>
              <name>RXUDR</name>
              <description>This is set to 1 when the receive FIFO underflows</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXOVR" -->
            <field>
              <name>RXOVR</name>
              <description>This is set to 1 when the receive FIFO overflows</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOPI" -->
            <field>
              <name>EOPI</name>
              <description>This is the interrupt flag based on the receive timer</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BSY" -->
            <field>
              <name>BSY</name>
              <description>This indicates the status of the serial transmit control unit</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXFI" -->
            <field>
              <name>TXFI</name>
              <description>This is set to 1 when the transmit FIFO empty slot meets or exceeds the threshold value</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXFI" -->
            <field>
              <name>RXFI</name>
              <description>This is set to 1 when the receive FIFO data count meets or exceeds the threshold value</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXNUM" -->
            <field>
              <name>TXNUM</name>
              <description>This indicates the data count in the transmit FIFO</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXNUM" -->
            <field>
              <name>RXNUM</name>
              <description>This indicates the data count in the receive FIFO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMAACT" -->
        <register>
          <name>DMAACT</name>
          <description>DMA Startup Register [BHW]</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01010101</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TL1E0" -->
            <field>
              <name>TL1E0</name>
              <description>This sets the operation mode of TXDREQ</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDMACT" -->
            <field>
              <name>TDMACT</name>
              <description>This bit is enabled when the same register TL1E0=0</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RL1E0" -->
            <field>
              <name>RL1E0</name>
              <description>This sets the operation mode of RXDREQ</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDMACT" -->
            <field>
              <name>RDMACT</name>
              <description>This bit is enabled when the same register RL1E0=0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSTREG" -->
        <register>
          <name>TSTREG</name>
          <description>Test Register [BHW]</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LBMD" -->
            <field>
              <name>LBMD</name>
              <description>This sets the loopback mode</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
