mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/s6e2dhxj.svd
        <!-- REGISTER "SRESP3" -->
        <register>
          <name>SRESP3</name>
          <description>Response Register 3 [BHW]</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SRESP4" -->
        <register>
          <name>SRESP4</name>
          <description>Response Register 4 [BHW]</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SRESP5" -->
        <register>
          <name>SRESP5</name>
          <description>Response Register 5 [BHW]</description>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SRESP6" -->
        <register>
          <name>SRESP6</name>
          <description>Response Register 6 [BHW]</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SRESP7" -->
        <register>
          <name>SRESP7</name>
          <description>Response Register 7 [BHW]</description>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "SBUFDP" -->
        <register>
          <name>SBUFDP</name>
          <description>Buffer Data Port Register [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "SPRSTAT" -->
        <register>
          <name>SPRSTAT</name>
          <description>Present State Register [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x010F0F07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMDLNSGN" -->
            <field>
              <name>CMDLNSGN</name>
              <description>CMD Line Signal Level</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LNSGNLVL" -->
            <field>
              <name>LNSGNLVL</name>
              <description>DAT Line Signal Level</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WPPINLVL" -->
            <field>
              <name>WPPINLVL</name>
              <description>Write Protect Switch Pin Level</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDDET" -->
            <field>
              <name>CARDDET</name>
              <description>Card Detect Pin Level</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDSTB" -->
            <field>
              <name>CARDSTB</name>
              <description>Card State Stable</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CARDINS" -->
            <field>
              <name>CARDINS</name>
              <description>Card Inserted</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BUFRDEN" -->
            <field>
              <name>BUFRDEN</name>
              <description>Buffer Read Enable</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BUFWREN" -->
            <field>
              <name>BUFWREN</name>
              <description>Buffer Write Enable</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDTRSFACT" -->
            <field>
              <name>RDTRSFACT</name>
              <description>Read Transfer Active</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WRTRSFACT" -->
            <field>
              <name>WRTRSFACT</name>
              <description>Write Transfer Active</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RETUNEREQ" -->
            <field>
              <name>RETUNEREQ</name>
              <description>Re-Tuning Request</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DATLNACT" -->
            <field>
              <name>DATLNACT</name>
              <description>DAT Line Active</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMDDATINH" -->
            <field>
              <name>CMDDATINH</name>
              <description>Command Inhibit (DAT)</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMDINH" -->
            <field>
              <name>CMDINH</name>
              <description>Command Inhibit (CMD)</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SHCTL1" -->
        <register>
          <name>SHCTL1</name>
          <description>Host Control 1 Register [BHW]</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CDSGNSEL" -->
            <field>
              <name>CDSGNSEL</name>
              <description>Card Detect Signal Selection</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDTSTLVL" -->
            <field>
              <name>CDTSTLVL</name>
              <description>Card Detect Test Level</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXTDTWIDTH" -->
            <field>
              <name>EXTDTWIDTH</name>
              <description>Extended Data Transfer Width</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMASEL" -->
            <field>
              <name>DMASEL</name>
              <description>DMA Select</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HIGHSPDEN" -->
            <field>
              <name>HIGHSPDEN</name>
              <description>High Speed Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAWIDTH" -->
            <field>
              <name>DATAWIDTH</name>
              <description>Data Transfer Width</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LEDCTRL" -->
            <field>
              <name>LEDCTRL</name>
              <description>LED Control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPWRCTL" -->
        <register>
          <name>SPWRCTL</name>
          <description>Power Control Register [BHW]</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDBUSVLSEL" -->
            <field>
              <name>SDBUSVLSEL</name>
              <description>SD Bus Voltage Select</description>
              <msb>3</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDBUSPWR" -->
            <field>
              <name>SDBUSPWR</name>
              <description>SD Bus Power</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SBLKGPCTL" -->
        <register>
          <name>SBLKGPCTL</name>
          <description>Block Gap Control Register [BHW]</description>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BLCKGAPINT" -->
            <field>
              <name>BLCKGAPINT</name>
              <description>Interrupt At Block Gap</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDWAITCTL" -->
            <field>
              <name>RDWAITCTL</name>
              <description>Read Wait Control</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONTREQ" -->
            <field>
              <name>CONTREQ</name>
              <description>Continue Request</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLCKGSTPREQ" -->
            <field>
              <name>BLCKGSTPREQ</name>
              <description>Stop At Block Gap Request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SWKUPCTL" -->
        <register>
          <name>SWKUPCTL</name>
          <description>Wakeup Control Register [BHW]</description>
          <addressOffset>0x2B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WKUPEVNTEN2" -->
            <field>
              <name>WKUPEVNTEN2</name>
              <description>Wakeup Event Enable On SD Card Removal</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUPEVNTEN1" -->
            <field>
              <name>WKUPEVNTEN1</name>
              <description>Wakeup Event Enable On SD Card Insertion</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUPEVNTEN0" -->
            <field>
              <name>WKUPEVNTEN0</name>
              <description>Wakeup Event Enable On SD Card Interrupt</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCLKCTL" -->
        <register>
          <name>SCLKCTL</name>
          <description>Clock Control Register [BHW]</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFE7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDCLKSEL" -->
            <field>
              <name>SDCLKSEL</name>
              <description>SDCLK Frequency Select</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UPSDCLKSEL" -->
            <field>
              <name>UPSDCLKSEL</name>
              <description>Upper Bits of SDCLK Frequency Select</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLCKGENSEL" -->
            <field>
              <name>CLCKGENSEL</name>
              <description>Clock Generator Select</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCLCKEN" -->
            <field>
              <name>SDCLCKEN</name>
              <description>SD Clock Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTLCLCKST" -->
            <field>
              <name>INTLCLCKST</name>
              <description>Internal Clock Stable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTLCLCKEN" -->
            <field>
              <name>INTLCLCKEN</name>
              <description>Internal Clock Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STOCTL" -->
        <register>
          <name>STOCTL</name>
          <description>Timeout Control Register [BHW]</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTTMOUTVAL" -->
            <field>
              <name>DTTMOUTVAL</name>
              <description>Data Timeout Counter Value</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
