mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/s6e2dhxj.svd
        <!-- REGISTER "NDAT2" -->
        <register>
          <name>NDAT2</name>
          <description>New Data 2 [BHW]</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ND63" -->
            <field>
              <name>ND63</name>
              <description>New Data flag of Rx Buffer 63</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND62" -->
            <field>
              <name>ND62</name>
              <description>New Data flag of Rx Buffer 62</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND61" -->
            <field>
              <name>ND61</name>
              <description>New Data flag of Rx Buffer 61</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND60" -->
            <field>
              <name>ND60</name>
              <description>New Data flag of Rx Buffer 60</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND59" -->
            <field>
              <name>ND59</name>
              <description>New Data flag of Rx Buffer 59</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND58" -->
            <field>
              <name>ND58</name>
              <description>New Data flag of Rx Buffer 58</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND57" -->
            <field>
              <name>ND57</name>
              <description>New Data flag of Rx Buffer 57</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND56" -->
            <field>
              <name>ND56</name>
              <description>New Data flag of Rx Buffer 56</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND55" -->
            <field>
              <name>ND55</name>
              <description>New Data flag of Rx Buffer 55</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND54" -->
            <field>
              <name>ND54</name>
              <description>New Data flag of Rx Buffer 54</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND53" -->
            <field>
              <name>ND53</name>
              <description>New Data flag of Rx Buffer 53</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND52" -->
            <field>
              <name>ND52</name>
              <description>New Data flag of Rx Buffer 52</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND51" -->
            <field>
              <name>ND51</name>
              <description>New Data flag of Rx Buffer 51</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND50" -->
            <field>
              <name>ND50</name>
              <description>New Data flag of Rx Buffer 50</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND49" -->
            <field>
              <name>ND49</name>
              <description>New Data flag of Rx Buffer 49</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND48" -->
            <field>
              <name>ND48</name>
              <description>New Data flag of Rx Buffer 48</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND47" -->
            <field>
              <name>ND47</name>
              <description>New Data flag of Rx Buffer 47</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND46" -->
            <field>
              <name>ND46</name>
              <description>New Data flag of Rx Buffer 46</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND45" -->
            <field>
              <name>ND45</name>
              <description>New Data flag of Rx Buffer 45</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND44" -->
            <field>
              <name>ND44</name>
              <description>New Data flag of Rx Buffer 44</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND43" -->
            <field>
              <name>ND43</name>
              <description>New Data flag of Rx Buffer 43</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND42" -->
            <field>
              <name>ND42</name>
              <description>New Data flag of Rx Buffer 42</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND41" -->
            <field>
              <name>ND41</name>
              <description>New Data flag of Rx Buffer 41</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND40" -->
            <field>
              <name>ND40</name>
              <description>New Data flag of Rx Buffer 40</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND39" -->
            <field>
              <name>ND39</name>
              <description>New Data flag of Rx Buffer 39</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND38" -->
            <field>
              <name>ND38</name>
              <description>New Data flag of Rx Buffer 38</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND37" -->
            <field>
              <name>ND37</name>
              <description>New Data flag of Rx Buffer 37</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND36" -->
            <field>
              <name>ND36</name>
              <description>New Data flag of Rx Buffer 36</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND35" -->
            <field>
              <name>ND35</name>
              <description>New Data flag of Rx Buffer 35</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND34" -->
            <field>
              <name>ND34</name>
              <description>New Data flag of Rx Buffer 34</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND33" -->
            <field>
              <name>ND33</name>
              <description>New Data flag of Rx Buffer 33</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND32" -->
            <field>
              <name>ND32</name>
              <description>New Data flag of Rx Buffer 32</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF0C" -->
        <register>
          <name>RXF0C</name>
          <description>Rx FIFO 0 Configuration [BHW]</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF7FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F0OM" -->
            <field>
              <name>F0OM</name>
              <description>FIFO 0 Operation Mode</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0WM" -->
            <field>
              <name>F0WM</name>
              <description>Rx FIFO 0 Watermark</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0S" -->
            <field>
              <name>F0S</name>
              <description>Rx FIFO 0 Size</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0SA" -->
            <field>
              <name>F0SA</name>
              <description>Rx FIFO 0 Start Address</description>
              <msb>15</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF0S" -->
        <register>
          <name>RXF0S</name>
          <description>Rx FIFO 0 Status [BHW]</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x033F3F7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RF0L" -->
            <field>
              <name>RF0L</name>
              <description>Rx FIFO 0 Message Lost</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0F" -->
            <field>
              <name>F0F</name>
              <description>Rx FIFO 0 Full</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0PI" -->
            <field>
              <name>F0PI</name>
              <description>Rx FIFO 0 Put Index</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0GI" -->
            <field>
              <name>F0GI</name>
              <description>Rx FIFO 0 Get Index</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0FL" -->
            <field>
              <name>F0FL</name>
              <description>Rx FIFO 0 Fill Level</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF0A" -->
        <register>
          <name>RXF0A</name>
          <description>Rx FIFO 0 Acknowledge [BHW]</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F0AI" -->
            <field>
              <name>F0AI</name>
              <description>Rx FIFO 0 Acknowledge Index</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXBC" -->
        <register>
          <name>RXBC</name>
          <description>Rx Buffer Configuration [BHW]</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RBSA" -->
            <field>
              <name>RBSA</name>
              <description>2</description>
              <msb>15</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF1C" -->
        <register>
          <name>RXF1C</name>
          <description>Rx FIFO 1 Configuration [BHW]</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF7FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F1OM" -->
            <field>
              <name>F1OM</name>
              <description>FIFO 1 Operation Mode</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1WM" -->
            <field>
              <name>F1WM</name>
              <description>Rx FIFO 1 Watermark</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1S" -->
            <field>
              <name>F1S</name>
              <description>Rx FIFO 1 Size</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1SA" -->
            <field>
              <name>F1SA</name>
              <description>Rx FIFO 1 Start Address</description>
              <msb>15</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF1S" -->
        <register>
          <name>RXF1S</name>
          <description>Rx FIFO 1 Status [BHW]</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC33F3F7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMS" -->
            <field>
              <name>DMS</name>
              <description>Debug Message Status</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RF1L" -->
            <field>
              <name>RF1L</name>
              <description>FIFO 1 Message Lost</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1F" -->
            <field>
              <name>F1F</name>
              <description>Rx FIFO 1 Full</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1PI" -->
            <field>
              <name>F1PI</name>
              <description>Rx FIFO 1 Put Index</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1GI" -->
            <field>
              <name>F1GI</name>
              <description>Rx FIFO 1 Get Index</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1FL" -->
            <field>
              <name>F1FL</name>
              <description>Rx FIFO 1 Fill Level</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF1A" -->
        <register>
          <name>RXF1A</name>
          <description>Rx FIFO 1 Acknowledge [BHW]</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F1AI" -->
            <field>
              <name>F1AI</name>
              <description>Rx FIFO 1 Acknowledge Index</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXESC" -->
        <register>
          <name>RXESC</name>
          <description>Rx Buffer/FIFO Element Size Configuration [BHW]</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000777</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RBDS" -->
            <field>
              <name>RBDS</name>
              <description>Rx Buffer Data Field Size</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1DS" -->
            <field>
              <name>F1DS</name>
              <description>Rx FIFO 1 Data Field Size</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0DS" -->
            <field>
              <name>F0DS</name>
              <description>Rx FIFO 0 Data Field Size</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
